<?php

use Illuminate\Database\Seeder;
use Carbon\Carbon;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $publishedDate1 = new Carbon('2019-03-20 00:00:00');
        $publishedDate2 = new Carbon('2018-06-1 00:00:00');
        $publishedDate3 = new Carbon('2020-01-1 00:00:00');
        $publishedDate4 = new Carbon('2022-08-1 00:00:00');
        DB::table('blog')->insert([
            ['title' => 'โรคเบาหวาน',
                'body' => 'เป็นการเจ็บป่วยเรื้อรังที่เกิดจากร่างกายไม่สามารถใช้น้ำตาลในเสือดได้ทั้งหมด
                เนื่องจากขาดฮอร์โมนอินซูสิน หรือภาวะดื้อต่ออินชูสิน ทำให้มีน้ำตาลในเลือดมากกว่าปกติ จนถูกขับออก
                ทางปัสสาวะ ซึ่งหากควบคุมระดับน้ำตาลไม่ดี สามารถก่อให้เกิดภาวะแทรกซ้อนต่างๆ ได้ เช่น ภาวะไต
                เสื่อม ระบบประสาทส่วนปลายเสื่อม จอประสาทตาเสื่อม ภาวะหลอดเลือดแดงแข็ง ภาวะหัวใจขาดเลือด
                ',
                'cause'=> '1. ความอ้วน การไม่ออกกำลังกาย ความเครียด ทำให้การตอบสนองของเนื้อเยื่อร่างกายต่ออินชูลินไม่ดี
                2. ผู้สูงอายุ การสังเคราะห์และการหลั่งฮอร์โมนอินซูลินลดลง
                3. โรคของตับอ่อน เช่น ตับอ่อนอักเสบ ได้รับการผ่าตัดตับอ่อน
                4. การติดเชื้อไวรัสบางชนิด เช่น หัด หัดเยอรมัน คางทูม ซึ่งมีผลต่อตับอ่อน
                5. การได้รับยบางชนิด เช่น สเตียรอยด์ ยาขับปัสสาวะ ยาคุมกำเนิดบางชนิด ทำให้มีการสร้างน้ำตาลมากขึ้น หรือการตอบสนองของอินซูลินไม่ดี
                6. การตังครรภ์ เนื่องจากมีการสร้างรฮอร์โมนจากรกหลายชนิตซึ่งมีผลยับยั้งการทำงานของอินซูลิน
                ',
                'symptom'=> '1. ปัสสาวะบ่อยและมาก ปัสสาวะกลางคืน คนปกติมักไม่ลุกขึ้นมาปัสสาวะกลางคืนหรือ
                อย่างมาก 1 ครั้ง แต่ในผู้ป่วยเบาหวานเมื่อระดับน้ำตาลสูงมากเกินซีดความสามารถของไตในการสกัดกั้นมิ
                ให้น้ำตาลออกมาในปัสสาวะ จะมีน้ำตาลออกมากับปัสสาวะซึ่งจะดึงน้ำออกมาด้วย ทำให้ปีสสาวะมากต้อง
                ลุกขึ้นมาปัสสาวะกลางคืนหลายครั้ง
                2. กระหายน้ำ ดื่มน้ำมาก เป็นผลจากการที่ร่างกายสูญเสียน้ำทางปัสสาวะมาก
                3. หิวบ่อย
                4. กินจุแต่น้ำหนักลด จากการที่ร่างกายไม่สามารถนำกลูโดสไปใช้เป็นพลังงาน จึงมีการ
                สลายพลังงานจากไขมันและกล้ามเนื้อ
                5. เป็นแผลและฝีง่าย หายยาก มีการติดเชื้อตามผิวหนัง เนื่องจากน้ำตาลสูง ทำให้เม็ด
                เลือดขาวกำจัดเชื้อโรคได้น้อยลง
                6. คันตามผิวหนัง มีการติดเชื้อราง่าย โดยเฉพาะบริเวณช่องคลอด ขาหนีบ
                7. ตาพร่ามัว
                8. ชาปลายมือ ปลายเท้า หย่อนสมรรถภาพทางเพศ เนื่องจากน้ำตาลที่สูงนานๆทำให้
                เส้นประสาทส่วนปลายเสื่อม เกิดแผลที่เท้าได้ง่ายเพราะไม่รู้สึก กว่าจะทราบแผลก็ลุกลามมากจนต้องตัดขา
                ',
                'eat'=> 'การรักษาโรคเบาหวานโดยการควบคุมอาหารมีความสำคัญมากในการลดระดับน้ำตาลใน โดยอาหารที่สามารถรับประทานได้อย่างไม่จำกัด ได้แก่ ผักใบเขียวทุกชนิด เนื้อสัตว์ไม่ติดมัน ไข่ขาว เป็นต้น อาหารบางชนิดสามารถรับประทานได้ในปริมาณจำกัด เช่น ผลไม้ แนะนำให้รับประทานผลไม้ชนิดหวานน้อย เช่น ฝรั่ง ชมพู่ แก้วมังกร เป็นต้น ผลไม้ชนิดอื่นก็สามารถรับประทานได้ แต่ต้องจำกัดปริมาณ เช่น ส้มเขียวหวาน ประมาณ 1-2 ผลเล็กต่อวัน กล้วยหอม 1 ผลต่อวัน หรือสับปะรด 1 ซีกต่อวัน เป็นต้น ส่วนอาหารที่ไม่ควรรับประทานเลยได้แก่ ขนมหวาน เบเกอรี่ เครื่องดื่มที่ใส่น้ำตาลปริมาณมาก เช่นน้ำผลไม้บรรจุขวด น้ำอัดลม เครื่องดื่มชูกำลัง กาแฟเย็น ชาเขียวบรรจุขวด',
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'published_at' => $publishedDate1->format('Y-m-d H:i:s'),
                ],
            ['title' => 'โรคกระดูกพรุน',
                'body' => 'โรคกระดูกพรุน (Osteoporosis) คือ โรคที่ร่างกายมีความหนาแน่นและมวลของกระดูกลดน้อยลง จนทำให้กระดูกเสื่อม เปราะบาง ผิดรูป และแตกหักได้ง่าย บางรายทำให้ส่วนสูงลดลงด้วยเพราะกระดูกผุกร่อน รวมทั้งอาจไม่สามารถทำงานหรือเคลื่อนไหวได้ตามปกติ ทนรับน้ำหนัก แรงกระแทก หรือแรงกดได้น้อยลง เนื่องจากความเจ็บปวดจากรอยแตกร้าวภายใน หรืออาจเกิดการแตกหักของกระดูกส่วนสำคัญ ซึ่งอาจส่งผลให้พิการได้ อย่างบริเวณกระดูกสันหลัง ซึ่งเป็นศูนย์กลางเส้นประสาทที่ควบคุมการเคลื่อนไหว',
                'cause'=> 'โรคกระดูกพรุนเกิดจากการทำงานที่ไม่สมดุลกันของเซลล์กระดูกทั้ง 2 ชนิด คือ เซลล์สร้างกระดูก (Osteoblast) และ เซลล์สลายกระดูก (Osteoclast) ซึ่งมีการสลายกระดูกมากกว่าการสร้างกระดูก โดยอาจเป็นเพราะมีปริมาณแคลเซียมในร่างกายไม่เพียงพอต่อกระบวนการสร้างกระดูก หรืออาจมีความผิดปกติของเซลล์กระดูก
                ปัจจัยที่อาจเป็นสาเหตุของโรคกระดูกพรุนได้ เช่น
                1.	อายุที่เพิ่มมากขึ้น เมื่อแก่ตัวลงกระดูกก็จะเปราะบาง และแตกหักง่ายหากถูกกระทบกระเทือนแม้ไม่รุนแรงก็ตาม เช่น การล้ม การกระแทก เป็นต้น
                2.	ฮอร์โมน การลดระดับของฮอร์โมนเอสโตรเจน (Estrogen) ในเพศหญิงอย่างการเข้าสู่วัยหมดประจำเดือนก็อาจทำให้กระดูกพรุนและเปราะบาง ส่วนในเพศชายจะมีความเสี่ยงเกิดโรคกระดูกพรุนเมื่อมีการผลิตฮอร์โมนเทสโทสเทอโรน (Testosterone) น้อยลง
                3.	กรรมพันธุ์ ผู้ที่มีญาติใกล้ชิดทางสายเลือดมีประวัติป่วยเป็นโรคกระดูกพรุนมีความเสี่ยงที่จะได้รับพันธุกรรมของโรคดังกล่าวไปด้วย
                4.	ความผิดปกติในการทำงานของต่อมและอวัยวะต่าง ๆ เช่น ต่อมไทรอยด์ ต่อมพาราไทรอยด์ ต่อมหมวกไต ไตและตับทำงานผิดปกติ เป็นต้น  
                5.	โรคและการเจ็บป่วย เช่น โรคที่เกี่ยวข้องกับตับ ไต โรคแพ้กลูเตน โรคมะเร็งกระดูก เป็นต้น
                6.	กินอาหารที่มีแคลเซียมไม่เพียงพอต่อความต้องการของร่างกายในการสร้างกระดูก หรือกินอาหารที่ทำให้แคลเซียมเสียสมดุล เช่น อาหารที่มีโปรตีนจากเนื้อสัตว์ซึ่งมีความเป็นกรดสูง ดื่มน้ำอัดลม ชา กาแฟ หรือเครื่องดื่มแอลกอฮอล์ และสูบบุหรี่ติดต่อกันปริมาณมากเป็นเวลานาน
                7.	พฤติกรรมการใช้ชีวิตประจำวัน การนั่งหรืออยู่ในอิริยาบถเดิม ๆ เป็นเวลานาน รวมทั้งการทำงานที่ต้องเคลื่อนไหวร่างกายอย่างหักโหมล้วนส่งผลต่อสุขภาพกระดูกทั้งสิ้น
                8.	การใช้ยาบางชนิด เช่น กลุ่มยาสเตียรอยด์ เพราะตัวยาบางชนิดจะออกฤทธิ์รบกวนกระบวนการสร้างกระดูก อย่างยาเพรดนิโซโลนที่มีฤทธิ์ต่อระบบภูมิคุ้มกันและใช้รักษาอาการอักเสบ
                ',
                'symptom'=> 'ผู้ป่วยโรคกระดูกพรุนมักจะทราบว่าตนป่วยเมื่อมีอาการแสดงไปแล้ว และยังมีอาการบ่งชี้อื่น ๆ ที่ควรใส่ใจสังเกต เพื่อให้สามารถรักษาได้ทันการณ์ ดังนี้
                1. กระดูกข้อมือ แขน สะโพก และกระดูกสันหลังแตกหักได้ง่าย แม้ถูกกระแทกแบบไม่รุนแรง
                2. หลังค่อม หรือกระดูกสันหลังส่วนบนโค้งลง
                3. ความสูงลดลง
                4. อาจมีอาการปวดหลังเรื้อรังด้วย',
                'eat'=> 'รับประทานอาหารที่มีโปรตีนในปริมาณที่เหมาะสมทั้งโปรตีนจากพืชและสัตว์ และรับประทานอาหารที่มีแคลเซียมและวิตามินดี ซึ่งเป็นสารอาหารหลักที่สำคัญต่อการสร้างกระดูก โดยควรรับประทานอาหารที่มีแคลเซียมสูง เช่น นม น้ำส้ม เต้าหู้ งา กุ้งฝอย ปลาตัวเล็ก ถั่วต่าง ๆ และผักใบเขียว อย่างเช่น ผักคะน้า ผักกระเฉด ใบยอ ใบชะพลู สะเดา กะเพรา ตำลึง เป็นต้น และอาหารที่มีวิตามินดี เช่น ตับ ไข่แดง นม เนื้อ ปลาทู ฟักทอง เห็ดหอม เป็นต้น',
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'published_at' => Carbon::now()->format('Y-m-d H:i:s'),
                ],
            ['title' => 'โรคไขมันในเลือดสูง',
                'body' => 'โรคไขมันในเลือดสูง เป็นภาวะที่ร่างกายมีระดับไขมันในเลือดสูงกว่าปกติ อาจเป็นระดับโคเลสเตอรอลสูงหรือระดับไตรกลีเซอร์ไรด์สูงอย่างใดอย่างหนึ่งหรือสูงทั้งสองชนิดก็ได้ ภาวะไขมันในเลือดสูงสามารถทำให้หลอดเลือดแข็ง ตีบ อุดตัน ซึ่งเป็นปัจจัยเสี่ยงสำคัญที่ทำให้เกิดโรคหัวใจและหลอดเลือด',
                'cause'=> '1. ภาวะอ้วนหรือน้ำหนักเกิน
                2. ขาดการออกกำลังกายสม่ำเสมอ
                3. การดื่มสุราหรือสูบบุหรี่เป็นประจำ
                4. รับประทานอาหารที่มีไขมันโคเลสเตอรอลสูง หรือรับประทานอาหารมากเกินความจำเป็นของร่างกาย5. โรคหรือการใช้ยาบางชนิด เช่น โรคไทรอยด์ทำงานน้อยกว่าปกติ  โรคเบาหวาน โรคไต ยาขับปัสสาวะ ยาสเตียรอยด์ ยาคุมกำเนิด เป็นต้น
                6. พันธุกรรม',
                'symptom'=> '1.คลื่นไส้ อาเจียน
                2.มีเหงื่อออกตามร่างกาย
                3.ปวดหัว วิงเวียน หน้ามืด
                4.ตาพล่ามัว มองเห็นไม่ชัด
                5.หายใจถี่ ชีพจรเต้นเร็ว ใจสั่น
                6.มีอาการอ่อนแรง เช่น หยิบจับของแล้วของหล่น
                7.ปวด แน่น เจ็บหน้าอก ร้าวไปยังบริเวณคอ กราม ไหล่ แขน
                8.มีปื้นสีเหลืองที่ผิวหนัง เช่น หนังข้อศอก หัวเข่าและฝ่ามือ
                ',
                'eat'=> '1. รับประทานอาหารที่มีปริมาณโคเลสเตอรอล ไม่เกิน 300 มิลลิกรัมต่อวัน
                2 หลึกเลี่ยงการรับประทานอาหารที่มีไขมันสูง เช่นไขมันจากสัตว์ หนังสัตว์ อาหารทอด
                3. หลีกเลี่ยงการรับประทานอาหารที่มีน้ำตาลมาก เช่น น้ำหวาน ขนมหวาน ลูกกวาด
                4. รับประทานอาหารที่มีกรดไขมันไลโนเลอิก โอเมก้า6 และ ไลโนเลนิก (โอเมก้า3) สูงชึ่งพบมากในพวกถั่ว งา น้ำมันพืชประเทถั่วเหลือง ช้าวโพด ฯลฯ
                5. เพิ่มการรับประทานอาหารที่มีส้นใยให้มากขึ้น เช่น ผัก ผลไม้ ข้าวซ้อมมือ ถั่วเมล็ดแห้ง
                ',
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'published_at' => $publishedDate2->format('Y-m-d H:i:s'),
                ],
            ['title' => 'โรคหัวใจและหลอดเลือด',
                'body' => 'โรคหัวใจ หมายถึง กลุ่มภาวะผิดปกติของหัวใจ ต้นเหตุของโรคหัวใจอาจเกิดจากภาวะผิดปกติของเส้นเลือดในหัวใจ โครงสร้างที่ผิดปกติตั้งแต่กำเนิด หรือ การเต้นของหัวใจที่ผิดปกติ โรคหัวใจมีอยู่หกประเภทหลัก ได้แก่ โรคหลอดเลือดหัวใจ หัวใจเต้นผิดจังหวะ ความผิดปกติตั้งแต่กำเนิด ความผิดปกติของกล้ามเนื้อหัวใจ ภาวะหัวใจติดเชื้อ และ ความผิดปกติของลิ้นหัวใจ',
                'cause'=> '1. มี LDL ในเลือดมาก เกิดจาการกินอาหารที่มีคลอเลสเตอรอลสูงและหรือกินอาหารที่มีกรดไขมันอิ่มตัวสูง
                2. มี HDL ในเลือดน้อย เกิดจากการขาดการออกกำลังกายและหรือกินน้ำตาลหรือของหวานมาก
                3. มีอนุมูลออกซิเจนอิสระ (fee oxygen radicals) ในร่างกายมาก หรือกินผัก ผลไม้(อาหารที่มีสารต้านอนุมูลอิสระ antioxidants) น้อย
                4. กินอาหารที่มีไขมันทรานส์มากหรือบ่อย
                ',
                'symptom'=> '1.	โรคหลอดเลือดหัวใจ มักส่งผลให้มีอาการเจ็บหรือแน่นหน้าอก ร้าวไปตามกราม แขน ลำคอ ท้อง หรือบริเวณหลัง และบางครั้งอาจมีอาการเหนื่อย อ่อนเพลีย ไม่มีแรง หรือหมดสติได้
                2.	โรคหัวใจเต้นผิดจังหวะ มีอาการผิดปกติของจังหวะการเต้นของหัวใจ อาจเต้นเร็วผิดปกติ ช้าผิดปกติ หรือเต้นไม่สม่ำเสมอ ทำให้รู้สึกใจสั่น แต่บางครั้งอาจแสดงอาการเหนื่อยง่าย แน่นหน้าอก เวียนศีรษะ หรือคล้ายจะเป็นลมได้เช่นกัน  
                3.	โรคกล้ามเนื้อหัวใจ ผู้ป่วยที่มาพบแพทย์มักมีอาการเหนื่อยง่าย หายใจไม่อิ่ม และมีอาการมากขึ้นเมื่อต้องออกแรงหนัก ๆ ส่วนโรคกล้ามเนื้อหัวใจที่รุนแรงมากขึ้นจะทำให้มีอาการเหนื่อยแม้ขณะนั่งอยู่เฉย ๆ มีอาการบวมตามแขน ขา หนังตา ร่วมกับอาการอ่อนเพลีย นอนราบไม่ได้ และตื่นขึ้นมาไอในเวลากลางคืน
                4.	โรคหัวใจพิการแต่กำเนิด เป็นโรคที่เกิดขึ้นตั้งแต่เมื่อทารกอยู่ในครรภ์มารดา โดยอาจแสดงอาการทันทีเมื่อแรกคลอด หรือแสดงอาการมากขึ้นในภายหลังก็ขึ้นอยู่กับความรุนแรงของโรค และสามารถแบ่งเป็น 2 กลุ่มหลัก ๆ คือกลุ่มที่มีอาการเขียวและกลุ่มไม่มีอาการเขียว ในกลุ่มที่มีอาการยังไม่รุนแรงมากอาจสังเกตได้ในภายหลัง เช่น เหนื่อยง่ายเวลาออกกำลังกายหรือทำกิจกรรมเมื่อเทียบกับเด็กวัยเดียวกัน แต่ในกลุ่มที่มีอาการมากจะทำให้เลี้ยงไม่โต ทารกมีอาการเหนื่อยขณะให้นมหรือติดเชื้อทางเดินหายใจบ่อย ๆ เป็นต้น
                5.	โรคลิ้นหัวใจ อาการของโรคขึ้นอยู่กับความผิดปกติของลิ้นหัวใจที่เกิดขึ้น ในกลุ่มที่มีความผิดปกติเพียงเล็กน้อยอาจไม่แสดงอาการใด ๆ หรืออาจได้ยินเสียงผิดปกติจากการตรวจร่างกายเท่านั้น แต่หากมีความผิดปกติของลิ้นหัวใจมากก็จะมีอาการเหนื่อยง่าย และเกิดภาวะหัวใจวายหรือน้ำท่วมปอดได้         
                6.	โรคติดเชื้อบริเวณหัวใจ อาการที่แสดงถึงโรคนี้ ได้แก่ มีไข้ โดยมักจะเป็นไข้เรื้อรัง อ่อนเพลีย เหนื่อยล้า หัวใจเต้นผิดปกติ หายใจหอบเหนื่อย ไอเรื้อรังแห้ง ๆ ขาหรือช่องท้องบวม รวมถึงมีผื่นหรือจุดขึ้นตามผิวหนัง
                ',
                'eat'=> 'อาหารที่ช่วยป้องกันการเกิดโรคหัวใจ และหลอดเลือดประกอบด้วยการหลีกเลี่ยงอาหารทอด เนื่องจากอาหารทอดมักมีกรดไขมันอิ่มตัวมากควรใช้น้ำมันที่มีกรดไขมันไม่อิ่มตัวเชิงเดี่ยว (Monounsaturates) และไขมันไม่อิ่มตัวเชิงซ้อน (Polyunsaturates) ในการประกอบอาหาร เช่น น้ำมันรำข้าว น้ำมันถั่วเหลือง รวมทั้งหลีกเลี่ยงกรดไขมันทรานส์ (Trans fatty acids) โดยหลีกเลี่ยงขนมอบ เบเกอรี่ โดนัท สำหรับคาร์โบไฮเดรตให้เลือกธัญชาติ ที่ผ่านการขัดสีน้อย เช่น ข้าวกล้องข้าวซ้อมมือ กินผักและผลไม้ให้มาก กินกรดไขมันไม่อิ่มตัวชนิดสายยาวกลุ่มโอเมก้า 3 ให้มาก (เช่น ปลาที่มีไขมันสูง ปลาทะเล) และกินเกลือแต่น้อย',
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'published_at' => Carbon::now()->format('Y-m-d H:i:s'),
                ],
            ['title' => 'โรคความดันโลหิตสูง',
                'body' => 'โรคความดันสูง หรือ โรคความดันโลหิตสูง(Hypertension/High Blood Pressure) เป็นภาวะความดันเลือดภายในหลอดเลือดแดงสูงกว่าปกติตลอดเวลา มีความดันช่วงบน ตั้งแต่ 130 มิลลิเมตรปรอทขึ้นไป 
                และ/หรือความดันช่วงล่างมีค่าตั้งแต่ 80 มิลลิเมตรปรอทขึ้นไป หากไม่ได้รับการรักษาที่ถูกต้องจะส่งผลให้เกิดปัญหาสุขภาพร้ายแรงตามมา จนอาจถึงขั้นเสียชีวิตได้
                ',
                'cause'=> '1. กรรมพันธุ์ ผู้ที่มีประวัติของคนในครอบครัว มีภาวะความดันโลหิตสูง
                2 อายุ ถ้าในวัยเด็กมีความดันโลหิตสูงเป็นครั้งคราว เมื่อเข้าสู่วัยกลางคน ตั้งแต่ประมาณ 4 ปีขึ้นไป มีโอกาสเป็นโรคความดันโลหิตสูงอย่างถาวร
                3. ผู้ที่มีน้ำหนักเกินและอ้วน มีโอกาสความตันโลหิตสูงมากกว่าผู้ที่มีน้ำหนักปกติ ดังนั้นผู้ชายควรมีรอบเอวไม่กิน 36 นิ้ว และผู้หญิงควรมีรอบเอวไม่เกิน 32 นิ้ว
                4. การบริโภคเกลือมาก ทำให้ความดันโลหิตสูง ถ้าลดบริโภคเกลือให้น้อยลง ความดันโลหิตจะลดลงด้วย
                5. การสูบบุหรี่ การดื่มสุราเป็นประจำ
                6. ภาวะไขมัน น้ำตาลในเลือดสูงอยู่นานๆ ทำให้ผนังหลอดเลือดหนาและแข็ง เกิดโรคหลอดเลือดแข็ง มีผลทำให้ความดันโลหิตสูง
                7. มีความเครียดเป็นประจำ
                ',
                'symptom'=> '1.	รายที่เป็นความดันโลหิตสูงชนิดไม่ทราบสาเหตุ ส่วนใหญ่จะมีไม่อาการแสดงแต่อย่างใด และมักตรวจพบได้โดยบังเอิญจากการตรวจคัดกรองโรค มีส่วนน้อยที่อาจมีอาการปวดมึนท้ายทอย ตึงที่ต้นคอ เวียนศีรษะ ซึ่งมักจะเป็นตอนตื่นนอนใหม่ๆ บางรายอาจมีอาการปวดศีรษะตุบๆ แบบไมเกรน
                2.	ส่วนในรายที่เป็นมานานๆ หรือมีความดันโลหิตสูงมากๆ อาจจะมีอาการอ่อนเพลีย เหนื่อยง่าย ใจสั่น นอนไม่หลับ ตามัว มือเท้าชา หรือมีเลือดกำเดาไหล
                ',
                'eat'=> 'อาหารที่ช่วยลดความดันโลหิตสูง คือ ผัก และผลไม้ที่มีโพสแทสเซียมสูง เพราะโพแทสเซียมจะช่วยควบคุมความดันโลหิตให้อยู่ในระดับปกติได้ ผัก และผลไม้ที่มีโพแทสเซียม ได้แก่ ลูกเกด เมล็ดทานตะวัน ผักโขม เห็ด กล้วย ส้ม ธัญพืชต่างๆโดยเฉพาถั่ว อาจจะเป็นพวกอบแห้งแบบไม่อบเกลือ เพราะไม่สามารถรับประทานอาหารที่มีโซเดียมที่สูงได้',
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'published_at' => $publishedDate3->format('Y-m-d H:i:s'),
                ],
            ['title' => 'โรคไต',
                'body' => 'โรคไตเรื้อรังแบ่งออกเป็น 5 ระยะ สามารถทราบระยะได้จากการตรวจเลือดและดูค่าของไต ที่เรียกว่า Creatinine มาวิเคราะห์ตามสูตร โดยคำนวนอายุ เพศ น้ำหนัก และคิดออกมาเป็นเปอร์เซ็นต์ ถ้าได้ 100 % แสดงว่าปกติ แต่หากคำนวณแล้วอยู่ที่ระหว่าง 90% คือ เป็นโรคไตระยะที่ 1 หากค่าอยู่ที่ 60 – 90 % คือระยะที่ 2 ค่าระหว่าง 30 - 60 % เป็นระยะที่ 3 ซึ่งทั้ง 3 ระยะ แทบจะไม่มีอาการแสดงให้เห็น ต่อมาในระยะที่ 4 คือมีค่าไต 15 –30%  ระยะที่ 5 ค่าไตทำงานต่ำกว่า 15 % ถือว่าเป็นโรคไตเรื้อรัง หรือ ไตวายระยะสุดท้าย',
                'cause'=> 'ปัจจัยที่เป็นต้นเหตุมีหลายอย่าง เช่น โรคหลอดเลือดฝอยของไตอักเสบโดยไม่ทราบสาเหตุ โรคที่ร่างกายสร้างสารขึ้นมาทำลายอวัยวะต่างๆ รวมทั้งไต เช่น โรค SLE โรคไตเป็นถุงน้ำมาแต่กำเนิด และโรคไตที่ถ่ายทอดทางพันธุกรรมบางชนิด โรคความดันโลหิตสูง และโรคเบาหวาน เป็นต้น นอกจากนี้ยังมีคนที่มีน้ำหนักเกินหรือเป็นโรคอ้วน และการสูบบุหรี่',
                'symptom'=> 'เกิดจากการทำงานของไตบกพร่อง ทำให้มีการคลั่งของเกลือ กรด และน้ำในร่างกาย รวมทั้งของเสียที่เกิดจากการเผาพลาญอาหารประเภทโปรตีน นอกจากนั้นหน้าที่ของไตในการสร้างฮอร์โมนบางชนิดผิดปกติ ผู้ป่วยจะมีอาการเบื่ออาหาร คลื่นไส้ อาเจียน อ่อนเพลีย โลหิตจาง คันตามตัว มีจ้ำตามตัว ความดันโลหิตสูง ปวดศีรษะ นอนไม่หลับ บวมที่หน้าและขา ชาตามปลายมือปลายเท้า เป็นตะคริว หัวใจล้มเหลว หัวใจเต้นผิดปกติ หายใจลำบาก น้ำท่วมปอด กระดูกบางเปราะหักง่าย ปวดกระดูก ถ้าของเสียค้างในสมองมากๆ จะมีอาการชัก ซึมลง สับสน นอกจากนี้ผู้ป่วยจะเป็นหมันและหมดสมรรถภาพทางเพศ ถ้าเกิดในเด็ก เด็กจะแคระแกร็น หยุดการเจริญเติบโต',
                'eat'=> 'อาหารจำกัดโซเดียม ได้แก่ อาหารที่มีรสเค็มจากการใช้เครื่องปรุงรสต่างๆ ไม่ว่าจะเป็นเกลือ น้ำปลา ซีอิ้ว หลีกเลี่ยง อาหารหมักดอง อาหารตากแห้ง อาหารว่างที่ออกรส เค็ม อาหารแปรรูป เช่น ไส้กรอก แฮม หมูยอ หมูหยอง อาหารสำเร็จรูป จำพวกโจ๊ก บะหมี่ วุ้นเส้น และขนมขบเคี้ยวต่างทุกชนิด
                อาหารจำกัดโปแตสเซียม ถ้าระดับโปแตสเซียมสูงมากอาจทำให้หัวใจหยุดเต้นได้ อาหารที่มีปริมาณโปแตสเซียมค่อนข้างต่ำ เช่น กะหล่ำปลี แตงกวา บวบ ฟักเขียว ถั่วงอก แตงโม และสับปะรดกระป๋อง',
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'published_at' => Carbon::now()->format('Y-m-d H:i:s'),
                ],
        ]);
    }
}
